//Дано число больше 9. Вывести на экран  вторую цифру числа с конца

int a=75;
int b=(a/10);
if (a<100)
{
    System.Console.WriteLine(b);
}


