// See https://aka.ms/new-console-template for more information
//Console.WriteLine("Hello, World!");//метод
//Console.WriteLine((2+2)*(2/2-2%2));

//Объявление перменных
//int a,b=0;
//double c;
//string s;

/* Многострочный комментарий
int a=2,b=3;//операция присваивания
int s=a+b;
System.Console.WriteLine(a+"+"+b+"="+s);//склеивание строчек
System.Console.WriteLine("{2}+{1}={0}",s,b,a);//строка форматирования
System.Console.WriteLine($"{a}+{b}={s}");//строка интерполяции
 */

//Вывести квадрат числа
//Ввести с клавиатуры целое число и вывести квадрат этого числа на экран
/*
int a;//переменная только целое число
int b;
string? s;
s=Console.ReadLine();
a=Convert.ToInt32(s);
b=a*a;
System.Console.WriteLine($"{a}^2={b}");
*/

/*
double a;//переменная может быть и дробной в т.ч.
double b;
string? s;
s=Console.ReadLine();
a=Convert.ToDouble(s);
//a=3.14;
b=a*a;
System.Console.WriteLine($"{a}^2={b}");
*/






