//Вывести на экран числа от -N до N

int i=-10;
int n=3;
while (i<=n)
{
    Console.Write($"{i} ");
    i=i+1;
}





