//Вывести на экран последнюю цифру целого числа введенного с клавиатуры. 

int a=1324;
int n=a%10;
System.Console.WriteLine(n);

